# OnlyOneSlopeCurtainRoof Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..OnlyOneSlopeCurtainRoof Property
BuiltInFailures..::..RoofFailures Class See Also
---
Only one slope in curtain roof.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OnlyOneSlopeCurtainRoof { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OnlyOneSlopeCurtainRoof As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OnlyOneSlopeCurtainRoof {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace